#!/usr.bin/python3
print('Python3运算符')

'''
Python算术运算符
    +   相加
    -   相减
    *   相乘
    /   相除
    %   取模
    **  取幂
    //  取整除
Python比较运算符
    ==  等于
    !=  不等于
    >   大于
    <   小于
    >=  大于等于
    <=  小于等于
Python赋值运算符
    =   简单的赋值运算符
    +=  加法赋值运算符
    -=  减法赋值运算符
    *=  乘法赋值运算符
    /=  除法赋值运算符
    %=  取模赋值运算符
    //= 取整除赋值运算符
    **= 幂赋值运算符
    :=  海象运算符，可在表达式内部为变量赋值。Python3.8版本新增运算符
Python位运算符
    &   按位与
    |   按位或
    ^   按位异或
    ~   按位取反
    <<  左移
    >>  右移
Python逻辑运算符
    and 逻辑与
    or  逻辑或
    not 逻辑非
Python成员运算符
    in      如果在指定的序列中找到值返回true，否则返回false
    not in  如果在指定的序列中没有找到值返回true，否则返回false
Python身份运算符
    is      判断两个标识符是不是引用自一个对象
    is not  判断两个标识符是不是引用自不同对象
'''